tap "buo/cask-upgrade"
tap "dunglas/frankenphp"
tap "felixkratz/formulae"
tap "oven-sh/bun"
# CLI tool for Angular
brew "angular-cli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# General-purpose scripting language
brew "php", restart_service: :changed
# Dependency Manager for PHP
brew "composer"
# Tool for exploring each layer in a docker image
brew "dive"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line DNS Client for Humans
brew "doggo"
# .NET Core
brew "dotnet"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Hex viewer/editor
brew "hexhog"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Cross-platform TUI database management tool
brew "lazysql"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Shell command parallelization utility
brew "parallel"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# PHP Static Analysis Tool
brew "phpstan"
# Tool for managing OCI containers and pods
brew "podman"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Opinionated Lua code formatter
brew "stylua"
# Subdomain discovery tool
brew "subfinder"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Enable Windows-like alt-tab
cask "alt-tab"
# Screen capturing tool
cask "cleanshot"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Universal database tool and SQL client
cask "dbeaver-community"
# Online diagram software
cask "drawio"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Web browser
cask "firefox"
cask "font-commit-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
# Git client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake-app"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# ZSA keyboard firmware flasher
cask "keymapp"
# 2D game framework for Lua
cask "love"
# Extensible two-pane file manager
cask "marta"
# Silence embarrassing notifications while screen sharing
cask "muzzle"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Flexible level editor
cask "tiled"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "angular.ng-template"
vscode "astro-build.astro-vscode"
vscode "avidworks.arctis"
vscode "benjaminbenais.copilot-theme"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "cipchk.cssrem"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "heybourn.headwind"
vscode "irongeek.vscode-env"
vscode "jakob101.relativepath"
vscode "liviuschera.noctis"
vscode "mechatroner.rainbow-csv"
vscode "menerv.love2d-launcher"
vscode "mikestead.dotenv"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-vsliveshare.vsliveshare"
vscode "pixelbyte-studios.pixelbyte-love2d"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-swedish"
vscode "timonwong.shellcheck"
vscode "tyriar.sort-lines"
vscode "ue.alphabetical-sorter"
vscode "usernamehw.errorlens"
vscode "wix.vscode-import-cost"
